// набір послідовності дій

/*
  вивести в консоль числа від 1 до 10

  створити змінну числа яка дорівнює 1
  зробити цикл який буде поступово збільшувати число до 10
  у тілі циклу показувати поточне значення змінної
*/
for(let i = 1; i <= 10; i++) {
  console.log(i);
}

// швидкість алгоритму вімірюватимемо в операціях (вхідних даних)
/*
  y = x - лінійна функція
  y = x ^ 2 - квадратична функція
  y = log x - логарифмічна
  y = 2 ^ x - експоненціальна
  y = x! - факторіал
*/

// яка з функцій зростає швидше?
/*
  y = x^2 + 200x + 151 - швидша
  y = 2^x + 382 - повільніша

  // x = 10
  100 + 2000 + 151 = 2251
  1024 + 382 = 1106

  x = 1_000_000
  1 * 10^12 + 2 * 10 ^8 + 151
  9.9 * 10^301029 + 382

  x = Infinity
  Infinity ^ 2
  2 ^ Infinity 
*/

/*
  x -> n (вхідні дані)
  y = x  -> O(n)
  y = x^5 -> O(n^5)
  y = log x -> O(log n)

  y = x^2 + x -> O(n^2 + n) -> O(n^2)
*/
