// Функції

// alert;
// console.log;

// дужки - виклик функції
// вхідні дані для функції переадються у дужки через кому
// вони називаються аргументами функції
// функція може мати будь-яку кількість аргументів
// alert('Hello there', 'sds', 'asd');

// функції після свого виконання повертають результат, 
// який можна зберігти у змінній або використати іншим чином
// let userName = prompt('Введіть ваше ім`я');

// alert( userName );

// Отримати від користувача його ім'я
// Привитатися з ним по імені, наприклад: Привіт, Кирило

let userName = prompt('Введіть ваше ім`я');

let greetingText = 'Привіт, ' + userName;

alert(greetingText);
